fusion/cfd/cases/OpenCFD_v2412/installed_pressure10_v1/system/blockMeshDict
/* Generated for OpenCFD OpenFOAM v2412; setup only. */
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

scale 1;
vertices
(
    (-0.42 -0.02 -0.32)
    (0.42 -0.02 -0.32)
    (0.42 0.47 -0.32)
    (-0.42 0.47 -0.32)
    (-0.42 -0.02 0.52)
    (0.42 -0.02 0.52)
    (0.42 0.47 0.52)
    (-0.42 0.47 0.52)
);
blocks (hex (0 1 2 3 4 5 6 7) (42 25 42) simpleGrading (1 1 1));
edges ();
boundary
(
    backgroundBox
    {
        type wall;
        faces ((0 4 7 3) (1 2 6 5) (0 1 5 4) (3 7 6 2) (0 3 2 1) (4 5 6 7));
    }
);
mergePatchPairs ();
