fusion/cfd/cases/OpenCFD_v2412/installed_pressure10_v1/system/snappyHexMeshDict
/* Generated for OpenCFD OpenFOAM v2412; setup only. */
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object snappyHexMeshDict;
}


castellatedMesh true; snap true; addLayers false;
geometry {
 fluid_boundary.stl {type triSurfaceMesh; name fluid; regions {printed {name printed;}
laptop {name laptop;}
noctua {name noctua;}
wall_plane {name wall_plane;}
ambient_openings {name ambient_openings;}}}
 interior {type searchableBox; min (-0.15 0.038 0.14); max (0.15 0.052 0.235);}
}
castellatedMeshControls {
 maxLocalCells 2000000; maxGlobalCells 4000000; minRefinementCells 0; maxLoadUnbalance 0.1;
 nCellsBetweenLevels 3; features ();
 refinementSurfaces {fluid {level (0 0); patchInfo {type wall;} regions {printed {level (3 3); patchInfo {type wall;}}
laptop {level (4 4); patchInfo {type wall;}}
noctua {level (3 3); patchInfo {type wall;}}
wall_plane {level (0 0); patchInfo {type wall;}}
ambient_openings {level (0 0); patchInfo {type patch;}}}}}
 resolveFeatureAngle 30;
 refinementRegions {interior {mode inside; levels ((1e15 4));}}
 locationInMesh (0 0.25 0.1); allowFreeStandingZoneFaces true;
}
snapControls {nSmoothPatch 3; tolerance 2; nSolveIter 30; nRelaxIter 5; nFeatureSnapIter 10; implicitFeatureSnap true; explicitFeatureSnap false; multiRegionFeatureSnap false;}
addLayersControls
{
    relativeSizes true;
    layers
    {
        laptop_shell { nSurfaceLayers 3; }
        wall_plane { nSurfaceLayers 3; }
        assumed_side_seals { nSurfaceLayers 3; }
        printed_or_model_walls { nSurfaceLayers 3; }
    }
    expansionRatio 1.2;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls 
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-18;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}
writeFlags (scalarLevels layerSets layerFields);
mergeTolerance 1e-6;

