fusion/cfd/cases/OpenCFD_v2412/installed_pressure10_v1/system/decomposeParDict
/* Generated for OpenCFD OpenFOAM v2412; setup only. */
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object decomposeParDict;
}

numberOfSubdomains 8; method scotch;